[
  {
    "title": "Verity",
    "author": "Colleen Hoover",
    "genre": "Psychological Thriller",
    "rating": 4.2,
    "cover": "https://m.media-amazon.com/images/I/91868k2+gUL._SL1500_.jpg",
    "color": "#18230F",
    "description": "A tense psychological thriller about a ghostwriter uncovering dark secrets in a bestselling author's manuscript.",
    "total_copies": 20,
    "available_copies": 18,
    "video": "https://youtube.com/embed/rc0jtWqiL-0",
    "summary": "Lowen Ashleigh, a struggling writer on the brink of financial ruin, is offered the job of a lifetime: to complete the remaining books in a bestselling series by Verity Crawford, a famous author who has been left incapacitated after a tragic accident. Moving into the Crawford home to review Verity's notes, Lowen discovers a hidden, unfinished autobiography—one that was never meant to be read. \n\nWhat begins as a professional task quickly spirals into a dark and disturbing obsession. The manuscript reveals chilling confessions about Verity's life, her marriage, and the shocking events leading up to her accident. As Lowen grows closer to Verity's husband, Jeremy, she must decide whether to reveal the disturbing truth—or protect him from it. \n\nVerity is a gripping psychological thriller that blurs the line between truth and fiction. With its unsettling twists and morally gray characters, it keeps readers questioning everything until the very last page."
  },
  {
    "title": "Murder on the Orient Express",
    "author": "Agatha Christie",
    "genre": "Mystery",
    "rating": 4.0,
    "cover": "https://m.media-amazon.com/images/I/71QZPV2T4tL._SL1500_.jpg",
    "color": "#3e3a36",
    "description": "Hercule Poirot investigates a murder on a snowbound train in this classic whodunit.",
    "total_copies": 22,
    "available_copies": 17,
    "video": "https://youtube.com/embed/Mq4m3yAoW8E",
    "summary": "Renowned detective Hercule Poirot boards the opulent Orient Express for a routine journey across Europe. Among the eclectic mix of passengers is a wealthy American man who seems anxious and seeks Poirot's protection—only to be found brutally murdered the next morning in his locked cabin. \n\nWith the train halted by heavy snow, Poirot launches an investigation confined to the train and its passengers. As he delves into their backgrounds, he uncovers layers of hidden connections, false identities, and long-buried secrets. Each clue adds complexity to what first appeared to be a straightforward case. \n\nMurder on the Orient Express is a masterful locked-room mystery that explores justice, morality, and collective guilt. With its rich character ensemble and a shocking resolution, it remains one of Agatha Christie's most iconic and thought-provoking works."
  },
  {
    "title": "And Then There Were None",
    "author": "Agatha Christie",
    "genre": "Mystery",
    "rating": 4.3,
    "cover": "https://m.media-amazon.com/images/I/51OtX9yf0HL.jpg",
    "color": "#2f2b27",
    "description": "Ten strangers invited to an island are accused, stalked, and one by one murdered, in this chilling classic.",
    "total_copies": 20,
    "available_copies": 14,
    "video": "https://youtube.com/embed/HfFqHONPUa0",
    "summary": "Ten strangers are invited to a secluded island off the Devon coast, each under different pretenses. Upon arrival, they discover their mysterious host is absent—and a chilling voice accuses each guest of a past crime. One by one, they begin to die, each death eerily mirroring a verse from a sinister nursery rhyme displayed in the house. \n\nWith no way to leave the island and no apparent killer among them, paranoia and fear mount. The guests begin to turn on each other, desperately trying to survive and uncover who—or what—is behind the orchestrated revenge. \n\nAnd Then There Were None is a haunting psychological thriller about guilt, justice, and the human instinct for survival. Christie masterfully builds suspense in this isolated setting, leading to a devastating and unforgettable conclusion that redefined the mystery genre."
  },
  {
    "title": "The Kite Runner",
    "author": "Khaled Hosseini",
    "genre": "Historical Drama",
    "rating": 4.5,
    "cover": "https://m.media-amazon.com/images/I/81IzbD2IiIL._SL1500_.jpg",
    "color": "#4DA8DA",
    "description": "A moving tale of friendship, betrayal, and redemption, set against the backdrop of Afghanistan's turbulent history.",
    "total_copies": 30,
    "available_copies": 25,
    "video": "https://youtube.com/embed/-KBnYdE3bnM",
    "summary": "Set against the backdrop of a changing Afghanistan, The Kite Runner follows Amir, a privileged boy from Kabul, and his loyal friend Hassan, the son of his father's servant. Bound by childhood, class, and a shared love for kite flying, their friendship is tested by a single act of betrayal that will haunt Amir for years. \n\nAs the Soviet invasion and Taliban rule reshape the country, Amir builds a new life in America—but the past refuses to stay buried. A phone call from an old friend offers him a chance at redemption and draws him back to a homeland he barely recognizes. \n\nThe Kite Runner is a powerful tale of guilt, forgiveness, and the enduring bonds of friendship. Hosseini crafts a deeply emotional narrative that explores how personal choices ripple across generations, and how one can seek forgiveness even in the face of deep regret."
  },
  {
    "title": "Gone Girl",
    "author": "Gillian Flynn",
    "genre": "Psychological Thriller",
    "rating": 4.1,
    "cover": "https://m.media-amazon.com/images/I/61Sx28fdUoL._SL1500_.jpg",
    "color": "#2d2a28",
    "description": "A gripping thriller about a marriage gone wrong, with unreliable narrators, dark secrets, and a disappearing wife.",
    "total_copies": 25,
    "available_copies": 20,
    "video": "https://youtube.com/embed/2-_-1nJf8Vg",
    "summary": "On the morning of their fifth wedding anniversary, Nick Dunne's wife, Amy, disappears without a trace. As the police investigation intensifies and media frenzy grows, all eyes turn to Nick, whose calm demeanor and inconsistent alibi raise serious suspicions. \n\nBut Amy isn't just any missing woman—she's the inspiration behind a popular children's book series and the mastermind of a meticulously crafted treasure hunt meant to celebrate their anniversary. As secrets unravel, the narrative splits between Nick's present-day account and Amy's past diary entries, painting two very different versions of their marriage. \n\nGone Girl is a razor-sharp psychological thriller that explores the dark undercurrents of modern relationships, media manipulation, and the facades people wear. With its jaw-dropping twists and morally complex characters, it delivers a chilling portrait of love turned toxic."
  },
  {
    "title": "Local Woman Missing",
    "author": "Mary Kubica",
    "genre": "Domestic Thriller",
    "rating": 4.0,
    "cover": "https://m.media-amazon.com/images/I/81v4RTUBB5L._SL1500_.jpg",
    "color": "#547792",
    "description": "A chilling domestic thriller about a woman who disappears and the secrets that unravel in her wake.",
    "total_copies": 18,
    "available_copies": 15,
    "video": "https://youtube.com/embed/r3muKXme4TI",
    "summary": "In a quiet suburban neighborhood, a woman named Shelby Tebow vanishes without a trace. Just weeks later, another mother and her young daughter also go missing, shaking the entire community. As panic spreads, suspicion falls on friends, neighbors, and even family members—everyone is hiding something. \n\nYears later, the case remains unsolved—until a girl believed to be long gone suddenly reappears. Her return forces buried secrets to the surface and reignites the search for answers. What really happened to the missing women, and how are their stories connected? \n\nLocal Woman Missing is a gripping and atmospheric thriller that weaves together multiple timelines and perspectives. With its unrelenting tension and jaw-dropping twists, it explores the dark side of suburbia and the lengths people will go to protect the truth."
  },
  {
    "title": "The Silent Patient",
    "author": "Alex Michaelides",
    "genre": "Psychological Thriller",
    "rating": 4.5,
    "cover": "https://m.media-amazon.com/images/I/61WpWzp3sSL._SL1000_.jpg",
    "color": "#4B778D",
    "description": "A chilling psychological thriller about a woman who stops speaking after committing a shocking act of violence—and the therapist obsessed with uncovering her motive.",
    "total_copies": 20,
    "available_copies": 14,
    "video": "https://youtube.com/embed/D5L7Z6L3_RZ1Bpw-",
    "summary": "Alicia Berenson was a successful painter married to a high-profile fashion photographer, living an enviable life in London—until one evening she shot her husband Gabriel five times in the face and never spoke another word. Her inexplicable silence turned a violent domestic incident into a widespread mystery, capturing public imagination and catapulting Alicia to infamous stardom.\n\nLocked away in a secure forensic unit, Alicia continues to paint but refuses to speak. Theo Faber, a forensic psychotherapist, becomes obsessed with Alicia's case and takes a job at the facility where she is held, determined to unravel the mystery of why she committed such a horrific act. As Theo digs deeper into Alicia's past, he begins to uncover disturbing truths—not only about her, but about himself.\n\nThe Silent Patient is a tightly woven psychological puzzle that explores the fragility of the human mind, the power of trauma, and the dangerous lengths people go to keep secrets buried. The final twist turns the entire narrative on its head, making it a shocking and unforgettable read."
  },
  {
    "title": "A Thousand Splendid Suns",
    "author": "Khaled Hosseini",
    "genre": "Historical Fiction / Drama",
    "rating": 4.4,
    "cover": "https://m.media-amazon.com/images/I/81xIPfJ6iUL._SL1500_.jpg",
    "color": "#E9A319",
    "description": "A deeply moving tale of friendship, sacrifice, and the resilience of two Afghan women over thirty tumultuous years.",
    "total_copies": 28,
    "available_copies": 24,
    "video": "https://youtube.com/embed/R_98h4A06mI",
    "summary": "Mariam, the daughter of a wealthy businessman and a village woman forced into marriage with Rasheed, finds her life trapped and lonely in Kabul. Years later, Laila, a bright young girl from a more progressive family, is also compelled to marry Rasheed after tragedy shatters her world. Initially at war, Mariam and Laila form an unbreakable bond of love and resistance.\n\nTogether, they endure the horrors of war, oppressive rule, and personal loss, creating a space of hope and defiance under Rasheed's roof. Their shared motherhood and sisterhood give them the courage to defy injustice and reclaim their own dignity. \n\nKhaled Hosseini's epic novel is a testament to the enduring power of love and the indomitable spirit of Afghan women."
  },
  {
    "title": "The Housemaid",
    "author": "Freida McFadden",
    "genre": "Psychological Thriller",
    "rating": 4.5,
    "cover": "https://m.media-amazon.com/images/I/81loPDFi-wL._SL1500_.jpg",
    "color": "#03346E",
    "description": "A gripping psychological thriller where a desperate housekeeper uncovers sinister secrets about her wealthy employers—and becomes trapped in their world.",
    "total_copies": 21,
    "available_copies": 16,
    "video": "https://youtube.com/embed/SwFTyt40tQg",
    "summary": "Millie, recently released from prison and struggling to rebuild her life, takes a job caring for an affluent family. Initially grateful for stability, she soon notices odd behavior—secretive conversations, strange house rules, and the eerie daughter who eyes her warily.\n\nAs she settles in, Millie uncovers clues—locked doors, coded notes, unexplained illnesses—that hint at dark family secrets. Tension escalates as she becomes both confessor and suspect, unsure who to trust or how deep the family’s deception runs.\n\nFreida McFadden crafts a claustrophobic thriller that explores guilt, perception, and the games people play. *The Housemaid* keeps you questioning every character’s motive right up to its shocking conclusion."
  },
  {
    "title": "The Night Circus",
    "author": "Erin Morgenstern",
    "genre": "Fantasy",
    "rating": 4.3,
    "cover": "https://m.media-amazon.com/images/I/815D5sneiNL._SL1500_.jpg",
    "color": "#000",
    "description": "A magical realism fantasy novel set in a mysterious circus that serves as a battleground for two young magicians locked in a deadly contest.",
    "total_copies": 25,
    "available_copies": 19,
    "video": "https://youtube.com/embed/41X6WalGSt4",
    "summary": "Le Cirque des Rêves appears without warning and is open only at night. Within its black-and-white striped tents lies a world entirely unique—breathtaking performances, enchanted gardens, and living statues. But beneath the circus's whimsical exterior lies a deeper magic, driven by a fierce competition between two young illusionists, Celia and Marco.\n\nBound into a magical duel by their mentors since childhood, Celia and Marco are destined to compete in a game of imagination and willpower. The catch: neither of them knows the rules or when the game will end. The circus itself becomes the venue of their duel, each act and tent an offering in their battle to outdo the other. As the two fall deeply in love, their competition threatens to destroy the one thing that brings them together—the circus.\n\nMorgenstern crafts a rich tapestry of fantastical wonder and quiet romance in a tale where fate, magic, and love intertwine. The Night Circus is a slow-burning, immersive experience that lingers like a dream long after the last page is turned."
  },
  {
    "title": "Mexican Gothic",
    "author": "Silvia Moreno-Garcia",
    "genre": "Horror",
    "rating": 4.1,
    "cover": "https://m.media-amazon.com/images/I/91JWQ95s5NL._SL1500_.jpg",
    "color": "#502e2d",
    "description": "A chilling horror novel set in 1950s Mexico, where a young socialite must uncover the dark secrets lurking in her cousin's new home.",
    "total_copies": 17,
    "available_copies": 13,
    "video":"https://youtube.com/embed/RaLcgDdkXkQ",
    "summary": "In 1950s Mexico City, glamorous socialite Noemí Taboada receives a frantic, cryptic letter from her recently married cousin Catalina, who pleads to be rescued from her new husband's family estate. Alarmed by the message's disturbing tone, Noemí travels to High Place, a crumbling manor located in a remote mountain village.\n\nWhat she finds is a house filled with strange inhabitants, unsettling silence, and an air thick with secrets. Catalina's new husband, Virgil Doyle, is as handsome as he is menacing, and his family is reclusive, eerie, and obsessed with disturbing ideas of racial purity. Noemí quickly realizes that the house holds a power of its own—one that invades her dreams with visions of blood and doom.\n\nAs she delves deeper into the mansion's history, she uncovers a legacy of madness, decay, and a horrifying ancient evil. Trapped by the remote location and growing threats, Noemí must fight not just to save her cousin but to keep her own mind from unraveling.\n\nMexican Gothic is a modern gothic horror masterpiece—lush, chilling, and deeply psychological."
  },
  {
    "title": "House of Leaves",
    "author": "Mark Z. Danielewski",
    "genre": "Horror, Experimental Fiction",
    "rating": 4.0,
    "cover": "https://m.media-amazon.com/images/I/711hUvzvB7L._SL1500_.jpg",
    "color": "#0a0a0a",
    "description": "An experimental horror novel that follows a family whose house contains a dark and expanding secret—endlessly shifting hallways and terrifying voids.",
    "total_copies": 12,
    "available_copies": 8,
    "video": "https://youtube.com/embed/whjRwVHZbHg",
    "summary": "When tattoo artist Johnny Truant finds a manuscript in the apartment of a deceased blind man named Zampanò, he stumbles into a disturbing literary rabbit hole. The manuscript documents a film called *The Navidson Record*, which follows a photojournalist and his family who move into a modest house in Virginia—only to discover that its interior is larger than its exterior, and new hallways appear and shift without explanation.\n\nAs Johnny tries to make sense of the fragmented writings, footnotes, and academic essays, he finds his own grip on reality weakening. The house within the manuscript seems to affect him directly, warping his perceptions and dragging him into a descent of psychological horror.\n\nPart horror story, part postmodern deconstruction, *House of Leaves* is unlike any book you've ever read. It plays with formatting, typography, and narrative structure, forcing readers to physically engage with the text as the story unfolds through multiple layers of unreliable narrators and eerie documentary-style entries. A cult classic, it explores madness, obsession, and the terrifying unknown that hides behind familiar walls."
  },
  {
    "title": "The Final Girl Support Group",
    "author": "Grady Hendrix",
    "genre": "Thriller, Horror",
    "rating": 4.2,
    "cover": "https://www.usatoday.com/gcdn/presto/2021/06/11/USAT/929bed59-9c8b-43d5-8120-dd2306017b68-Final_Girl_Support_Group.jpeg?crop=463,463,x0,y105",
    "color": "#000",
    "description": "A thrilling horror novel centered around a support group for women who survived mass killings—until someone starts picking them off one by one.",
    "total_copies": 15,
    "available_copies": 10,
    "video": "https://youtube.com/embed/5SdLu1j6qSo",
    "summary": "Every horror fan knows the trope of the 'final girl'—the lone survivor left standing after a massacre. In Grady Hendrix's clever meta-thriller, those girls are real. Lynnette Tarkington is one of them. She survived a horrific slaughter years ago and now attends therapy sessions with five other final girls, each from different mass murder events.\n\nThe group exists to help them cope, survive, and stay out of the public eye. But when one of the girls misses a session—and is later found dead—the fragile safety they've clung to shatters. Someone has found them. And this person seems intent on finishing what those killers started.\n\nAs paranoia spreads and the group begins to fracture, Lynnette must revisit the trauma she has spent years suppressing. She knows the patterns, the weapons, the rules. But this time, she might be facing a killer who knows the final girls better than they know themselves.\n\nDarkly funny, sharply paced, and laced with pop culture references, *The Final Girl Support Group* is a love letter to slasher films and a pulse-pounding story of survival."
  },
  {
    "title": "A Deadly Education",
    "author": "Naomi Novik",
    "genre": "Dark Fantasy",
    "rating": 4.4,
    "cover": "https://m.media-amazon.com/images/I/71NzGuw+83L._SL1500_.jpg",
    "color": "#2c2938",
    "description": "A twisted take on magical school fantasy where survival is the curriculum and friendships are as dangerous as spells.",
    "total_copies": 22,
    "available_copies": 18,
    "video": "https://youtube.com/embed/LnlKXA9_leY",
    "summary": "At the Scholomance, there's only one rule: survive. No teachers. No breaks. And no way to leave until graduation—or death. Monsters called mals lurk everywhere, and students must learn magic not just to cast spells but to fight for their lives.\n\nGaladriel “El” Higgins is an unwilling dark sorceress with massive destructive power. Everyone thinks she's destined to become a villain. But El doesn't want to hurt anyone—she just wants to graduate alive. Unfortunately, staying alive is harder when everyone fears you.\n\nWhen Orion Lake, the school's golden boy monster-slayer, saves El's life, their lives become tangled together. Now El must choose between embracing her darkness or trusting someone for the first time.\n\nNaomi Novik reinvents the magic school trope with a gritty, witty, and emotionally rich story that combines high-stakes action with social commentary. It's Hogwarts meets The Hunger Games—with teeth."
  },
  {
    "title": "Lock Every Door",
    "author": "Riley Sager",
    "genre": "Suspense Thriller",
    "rating": 4.0,
    "cover": "https://m.media-amazon.com/images/I/81HqmKfRwgL._SL1500_.jpg",
    "color": "#075B5E",
    "description": "A spine-chilling thriller set in a mysterious Manhattan apartment building filled with secrets and danger.",
    "total_copies": 18,
    "available_copies": 13,
    "video": "https://youtube.com/embed/8lO5qJV1IV4",
    "summary": "Jules Larsen is broke, jobless, and newly single. So when she gets a high-paying opportunity to apartment-sit at the Bartholomew—a luxurious but infamous Manhattan building—she jumps at the chance. But there's a catch: no visitors, no nights away, and she must never talk to other residents.\n\nAs Jules explores the grand, eerie halls of the Bartholomew, she becomes uneasy. Her fellow apartment sitters start disappearing, and she uncovers a series of dark legends connected to the building's past. When one of them vanishes without a trace, Jules digs into the history and finds something terrifying beneath the surface.\n\nThe more she investigates, the more she realizes the Bartholomew is no ordinary place—and that she may be its next victim. Tense, fast-paced, and full of twists, *Lock Every Door* is a modern Gothic suspense novel that echoes *Rosemary's Baby* and *The Shining*."
  },
  {
    "title": "Coraline",
    "author": "Neil Gaiman",
    "genre": "Dark Fantasy, Horror",
    "rating": 4.5,
    "cover": "https://m.media-amazon.com/images/I/81lU6I-SGDL._SL1299_.jpg",
    "color": "#1e1b2c",
    "description": "A modern fairy tale that takes a curious girl through a doorway into a twisted version of her own home—and a dark battle for her soul.",
    "total_copies": 30,
    "available_copies": 27,
    "video": "https://youtube.com/embed/GLXLxcC92HY",
    "summary": "Coraline Jones is a brave and curious girl who finds a hidden door in her family's new home. On the other side is a flat that looks like hers—but better. There's another mother and another father who seem more fun and attentive. But they have buttons for eyes, and something about them feels wrong.\n\nAs Coraline spends more time in the other world, she realizes it's not a dream—it's a trap. The other mother wants Coraline to stay forever, and she won't take no for an answer. Coraline must use her courage, wits, and love for her real parents to escape the web of illusions and rescue the souls of other trapped children.\n\nNeil Gaiman's *Coraline* is both eerie and enchanting, filled with macabre humor, childlike wonder, and sinister undertones. A dark fantasy classic that appeals to both young and adult readers."
  }
]